CRNBuilder-edited/data/Sandia_flame_D/case/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];


internalField   nonuniform List<scalar> 
113400
(
8.5632705e-05
0.00019980964
0.00032540428
0.00045263001
0.00058039944
0.00070841601
0.00083656565
0.00096479514
...
)
;

boundaryField
{
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    fuelinlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
28
(
8.5632705e-05
0.00019980964
0.00032540428
0.00045263001
0.00058039944
0.00070841601
0.00083656565
0.00096479514
...
)
;
    }
    innerwall
    {
        type            calculated;
        value           nonuniform List<scalar> 2(0.0036593693 0.0037842386);
    }
    pilotinlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
0.0039122645
0.0040433777
0.0041744916
0.0043056062
0.0044367215
0.0045678373
0.0046989536
0.0048300704
...
)
;
    }
    outerwall
    {
        type            calculated;
        value           nonuniform List<scalar> 2(0.009179033 0.0093538613);
    }
    airinlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
180
(
0.0095157084
0.009665597
0.0098172371
0.009970649
0.010125853
0.010282871
0.010441724
0.010602433
...
)
;
    }
    leftside
    {
        type            calculated;
        value           nonuniform List<scalar> 
450
(
0.099904822
0.099904822
0.099904822
0.099904822
0.099904822
0.099904822
0.099904822
0.099904822
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
252
(
8.5632705e-05
0.00019980964
0.00032540428
0.00045263001
0.00058039944
0.00070841601
0.00083656565
0.00096479514
...
)
;
    }
    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
