CRNBuilder-edited/data/Sandia_flame_D/case/0/G
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      zMix;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    fuelinlet           
    {
	type            MarshakRadiation;
        T               T;
        emissivityMode  lookup;
        emissivity      uniform 1.0;
        value           $internalField;
    }

    innerwall
    {
	type            MarshakRadiation;
        T               T;
        emissivityMode  lookup;
        emissivity      uniform 1.0;
        value           $internalField;
    }
    
    pilotinlet           
    {
	type            MarshakRadiation;
        T               T;
        emissivityMode  lookup;
        emissivity      uniform 1.0;
        value           $internalField;
    }

    outerwall
    {
	type            MarshakRadiation;
        T               T;
        emissivityMode  lookup;
        emissivity      uniform 1.0;
        value           $internalField;
    }

    airinlet           
    {
	type            MarshakRadiation;
        T               T;
        emissivityMode  lookup;
        emissivity      uniform 1.0;
        value           $internalField;
    }

    outlet          
    {
	type            MarshakRadiation;
        T               T;
        emissivityMode  lookup;
        emissivity      uniform 1.0;
        value           $internalField;
    }

    leftside      
    {
	type            MarshakRadiation;
        T               T;
        emissivityMode  lookup;
        emissivity      uniform 1.0;
        value           $internalField;
    }

    front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }

    axis
    {
        type            empty;
    }
}

// ************************************************************************* //
