CRNBuilder-edited/data/Sandia_flame_D/case/constant/massFlowProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      massFlowProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//- Specify the inlets
inletPatches
(
	fuelinlet
  pilotinlet
	airinlet    
);

//- Specify the outlet
outletPatches
(
	outlet
);
